Revit.Elements.CurtainPanel.ByElement(Revit.Elements.Element)
get all panels of curtain wall, system or slope glazing roof
hostingElement:

Revit.Elements.CurtainPanel.AsFamilyInstance
Gets family instance from curtain Panel
Returns: